#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.frontend_endpoint.module.frontend_app_service.random_pet.pet_name: Refreshing state... [id=polished-oarfish]
module.backend_endpoint.module.backend_app_service.random_pet.pet_name: Refreshing state... [id=poetic-hamster]
module.frontend_endpoint.module.frontend_app_service.module.subnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend_endpoint.module.subnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend_endpoint.module.backend_app_service.module.subnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.frontend_endpoint.module.subnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend_endpoint.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend_endpoint.module.subnet.module.vnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend_endpoint.module.backend_app_service.module.subnet.module.vnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.frontend_endpoint.module.frontend_app_service.module.subnet.module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Network/virtualNetworks/prod-vnet-cis-neubank]
module.backend_endpoint.module.backend_app_service.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.frontend_endpoint.module.subnet.module.vnet.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend_endpoint.module.backend_app_service.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/prod-asp-cis-neubank-use-001]
module.frontend_endpoint.module.frontend_app_service.module.subnet.azurerm_subnet.app_service_subnet: Refreshing state... [id=/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Network/virtualNetworks/prod-vnet-cis-neubank/subnets/app-service-subnet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.backend_endpoint.azurerm_private_endpoint.frontend_endpoint will be created
  + resource "azurerm_private_endpoint" "frontend_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "prod-endpoint-cis-neubank"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "prod-rgp-cis-neubank-use-001"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prod-privateconnection-cis-neubank"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.frontend_endpoint.azurerm_private_endpoint.frontend_endpoint will be created
  + resource "azurerm_private_endpoint" "frontend_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "prod-endpoint-cis-neubank"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "prod-rgp-cis-neubank-use-001"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prod-privateconnection-cis-neubank"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.backend_endpoint.module.backend_app_service.azurerm_linux_web_app.backend_linux_web_app will be created
  + resource "azurerm_linux_web_app" "backend_linux_web_app" {
      + app_settings                                   = {
          + "ENVIRONMENT" = "prod"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "prod-backend-poetic-hamster-service-cis-neubank-use-001"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + service_plan_id                                = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/prod-asp-cis-neubank-use-001"
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + go_version               = "1.19"
            }
        }
    }

  # module.backend_endpoint.module.rgp.azurerm_resource_group.rgp will be destroyed
  # (because azurerm_resource_group.rgp is not in configuration)
  - resource "azurerm_resource_group" "rgp" {
      - id       = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001" -> null
      - location = "eastus" -> null
      - name     = "prod-rgp-cis-neubank-use-001" -> null
      - tags     = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.backend_endpoint.module.subnet.azurerm_subnet.app_service_subnet will be created
  + resource "azurerm_subnet" "app_service_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-service-subnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + virtual_network_name                           = "prod-vnet-cis-neubank"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.frontend_endpoint.module.frontend_app_service.azurerm_linux_web_app.frontend_linux_web_app will be created
  + resource "azurerm_linux_web_app" "frontend_linux_web_app" {
      + app_settings                                   = {
          + "ENVIRONMENT" = "prod"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "prod-frontend-polished-oarfish-service-cis-neubank-use-001"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + virtual_network_subnet_id                      = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Network/virtualNetworks/prod-vnet-cis-neubank/subnets/app-service-subnet"
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.frontend_endpoint.module.subnet.azurerm_subnet.app_service_subnet will be created
  + resource "azurerm_subnet" "app_service_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-service-subnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + virtual_network_name                           = "prod-vnet-cis-neubank"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.backend_endpoint.module.backend_app_service.module.subnet.azurerm_subnet.app_service_subnet will be created
  + resource "azurerm_subnet" "app_service_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-service-subnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "prod-rgp-cis-neubank-use-001"
      + virtual_network_name                           = "prod-vnet-cis-neubank"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.backend_endpoint.module.subnet.module.rgp.azurerm_resource_group.rgp will be destroyed
  # (because azurerm_resource_group.rgp is not in configuration)
  - resource "azurerm_resource_group" "rgp" {
      - id       = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001" -> null
      - location = "eastus" -> null
      - name     = "prod-rgp-cis-neubank-use-001" -> null
      - tags     = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.backend_endpoint.module.subnet.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "prod-vnet-cis-neubank"
      + resource_group_name = "prod-rgp-cis-neubank-use-001"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.frontend_endpoint.module.frontend_app_service.module.asp.azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "prod-asp-cis-neubank-use-001"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "prod-rgp-cis-neubank-use-001"
      + sku_name                     = "B1"
      + tags                         = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
      + worker_count                 = (known after apply)
    }

  # module.frontend_endpoint.module.frontend_app_service.module.subnet.azurerm_subnet.app_service_subnet will be updated in-place
  ~ resource "azurerm_subnet" "app_service_subnet" {
        id                                             = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Network/virtualNetworks/prod-vnet-cis-neubank/subnets/app-service-subnet"
        name                                           = "app-service-subnet"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.frontend_endpoint.module.subnet.module.rgp.azurerm_resource_group.rgp will be destroyed
  # (because azurerm_resource_group.rgp is not in configuration)
  - resource "azurerm_resource_group" "rgp" {
      - id       = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001" -> null
      - location = "eastus" -> null
      - name     = "prod-rgp-cis-neubank-use-001" -> null
      - tags     = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.frontend_endpoint.module.subnet.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "prod-vnet-cis-neubank"
      + resource_group_name = "prod-rgp-cis-neubank-use-001"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.backend_endpoint.module.backend_app_service.module.subnet.module.rgp.azurerm_resource_group.rgp will be destroyed
  # (because azurerm_resource_group.rgp is not in configuration)
  - resource "azurerm_resource_group" "rgp" {
      - id       = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001" -> null
      - location = "eastus" -> null
      - name     = "prod-rgp-cis-neubank-use-001" -> null
      - tags     = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.backend_endpoint.module.backend_app_service.module.subnet.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "prod-vnet-cis-neubank"
      + resource_group_name = "prod-rgp-cis-neubank-use-001"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.frontend_endpoint.module.frontend_app_service.module.asp.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.frontend_endpoint.module.frontend_app_service.module.subnet.module.rgp.azurerm_resource_group.rgp will be destroyed
  # (because azurerm_resource_group.rgp is not in configuration)
  - resource "azurerm_resource_group" "rgp" {
      - id       = "/subscriptions/d063e60d-3b0a-485a-962f-8c9626038feb/resourceGroups/prod-rgp-cis-neubank-use-001" -> null
      - location = "eastus" -> null
      - name     = "prod-rgp-cis-neubank-use-001" -> null
      - tags     = {
          - "Environment" = "Prod"
          - "Owner"       = "first.last@company.com"
          - "Project"     = "Mortgage Calculator"
        } -> null
    }

  # module.frontend_endpoint.module.frontend_app_service.module.subnet.module.vnet.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Prod"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

Plan: 13 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dbwest, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Prod`*